### Creating dataframes

In [4]:
import pandas as pd
import numpy as np
import numpy as np

In [1]:
# Initialize an empty dataframe and add values to it
columns_to_create = ['location','state','name','lastname','challenge_one_grade','challenge_two_grade','challenge_three_grade']
df = pd.DataFrame(columns = columns_to_create)
# Add records to dataframe using the .loc function
df.loc[0] = ["Austin","TX","Juanes","Martinez!!!",111,99,70] 
df.loc[1] = ["Austin","TX","Ellie","Smith",88,95,100] 
df.loc[2] = ["San Antonio","TX","George","Garcia",100,np.nan,np.nan] 
df.loc[3] = ["Laredo","TX","Maria","Logit",100,100,100] 
df.loc[4] = ["Dallas","TX","Test","Account",55,60,90] 
df.loc[5] = ["El Paso","TX","Gina","Perdue",75,86,np.nan] 
df.loc[6] = ["Chicago","IL","Andrew","Lablanc",81,83,55] 
df.loc[7] = ["Naperville","IL","Joe","Dile",77,45,81] 
df.loc[8] = ["Springfield","IL","Mary","Smith",32,75,99] 
df.loc[9] = ["Miami","FL","Tabelon","Legruti",100,95,81] 
df.loc[10] = ["Orlando","FL","Wuda","Jenkins",30,0,75] 
df

NameError: name 'pd' is not defined

In [3]:
# Creating with lists
list_of_grades = []
list_of_grades.append(["Austin","TX","Juan","Martinez",100,99,70])
list_of_grades.append(["Austin","TX","Ellie","Smith",88,95,100]) 
list_of_grades.append(["San Antonio","TX","George","Garcia",100,np.nan,np.nan]) 
list_of_grades.append(["Laredo","TX","Maria","Logit",100,100,100]) 
list_of_grades.append(["Dallas","TX","Test","Account",55,60,90]) 
list_of_grades.append(["El Paso","TX","Gina","Perdue",75,86,np.nan]) 
list_of_grades.append(["Chicago","IL","Andrew","Lablanc",81,83,55])
list_of_grades.append(["Naperville","IL","Joe","Dile",77,45,81]) 
list_of_grades.append(["Springfield","IL","Mary","Smith",32,75,99]) 
list_of_grades.append(["Miami","FL","Tabelon","Legruti",100,95,81])
list_of_grades.append(["Orlando","FL","Wuda","Jenkins",30,0,75]) 

for row in list_of_grades:
    print(row)

['Austin', 'TX', 'Juan', 'Martinez', 100, 99, 70]
['Austin', 'TX', 'Ellie', 'Smith', 88, 95, 100]
['San Antonio', 'TX', 'George', 'Garcia', 100, nan, nan]
['Laredo', 'TX', 'Maria', 'Logit', 100, 100, 100]
['Dallas', 'TX', 'Test', 'Account', 55, 60, 90]
['El Paso', 'TX', 'Gina', 'Perdue', 75, 86, nan]
['Chicago', 'IL', 'Andrew', 'Lablanc', 81, 83, 55]
['Naperville', 'IL', 'Joe', 'Dile', 77, 45, 81]
['Springfield', 'IL', 'Mary', 'Smith', 32, 75, 99]
['Miami', 'FL', 'Tabelon', 'Legruti', 100, 95, 81]
['Orlando', 'FL', 'Wuda', 'Jenkins', 30, 0, 75]

In [4]:
# create df
columns_to_create = ['location','state','name','lastname','challenge_one_grade','challenge_two_grade','challenge_three_grade']
df_from_list = pd.DataFrame(data=list_of_grades,columns = columns_to_create)
df_from_list

,location,state,name,lastname,challenge_one_grade,challenge_two_grade,challenge_three_grade
0,Austin,TX,Juan,Martinez,100,99.0,70.0
1,Austin,TX,Ellie,Smith,88,95.0,100.0
2,San Antonio,TX,George,Garcia,100,NaN,NaN
3,Laredo,TX,Maria,Logit,100,100.0,100.0
4,Dallas,TX,Test,Account,55,60.0,90.0
5,El Paso,TX,Gina,Perdue,75,86.0,NaN
6,Chicago,IL,Andrew,Lablanc,81,83.0,55.0
7,Naperville,IL,Joe,Dile,77,45.0,81.0
8,Springfield,IL,Mary,Smith,32,75.0,99.0
9,Miami,FL,Tabelon,Legruti,100,95.0,81.0
10,Orlando,FL,Wuda,Jenkins,30,0.0,75.0

In [ ]:
",".join([f"{l}" for l in list(df_from_list['challenge_three_grade'])])

In [5]:
# Create lists
location_list = ['Austin','Austin','San Antonio','Laredo','Dallas','El Paso','Chicago','Naperville','Springfield','Miami','Orlando']
state_list = ['TX','TX','TX','TX','TX','TX','IL','IL','IL','FL','FL']
name_list = ['Juan','Ellie','George','Maria','Test','Gina','Andrew','Joe','Mary','Tabelon','Wuda']
lastname_list = ['Martinez','Smith','Garcia','Logit','Account','Perdue','Lablanc','Dile','Smith','Legruti','Jenkins']
challenge_one_grade = [100,88,100,100,55,75,81,77,32,100,30]
challenge_two_grade = [99.0,95.0,np.nan,100.0,60.0,86.0,83.0,45.0,75.0,95.0,0.0]
challenge_three_grade = [70.0,100.0,np.nan,100.0,90.0,np.nan,55.0,81.0,99.0,81.0,75.0]

# Create dictionary of lists
class_data = { 'location': location_list,
               'state': state_list,
               'name': name_list,
               'lastname': lastname_list,
               'challenge_one_grade': challenge_one_grade,
               'challenge_two_grade': challenge_two_grade,
               'challenge_three_grade': challenge_three_grade}

In [6]:
# create df
columns_to_create = ['location','state','name','lastname','challenge_one_grade','challenge_two_grade','challenge_three_grade']
df_from_dict = pd.DataFrame(data=class_data,columns = columns_to_create)
df_from_dict

,location,state,name,lastname,challenge_one_grade,challenge_two_grade,challenge_three_grade
0,Austin,TX,Juan,Martinez,100,99.0,70.0
1,Austin,TX,Ellie,Smith,88,95.0,100.0
2,San Antonio,TX,George,Garcia,100,NaN,NaN
3,Laredo,TX,Maria,Logit,100,100.0,100.0
4,Dallas,TX,Test,Account,55,60.0,90.0
5,El Paso,TX,Gina,Perdue,75,86.0,NaN
6,Chicago,IL,Andrew,Lablanc,81,83.0,55.0
7,Naperville,IL,Joe,Dile,77,45.0,81.0
8,Springfield,IL,Mary,Smith,32,75.0,99.0
9,Miami,FL,Tabelon,Legruti,100,95.0,81.0
10,Orlando,FL,Wuda,Jenkins,30,0.0,75.0

In [ ]:
df_from_dict['state'].value_counts()